app/controllers/workouts_controller.rb

SELECT "workouts".* FROM "workouts" ORDER BY created_at DESC
---
  def index
    @workouts = Workout.all.order("created_at DESC")

INSERT INTO "workouts" ("date", "workout", "mood", "length", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["date", 2017-03-20 20:28:00 UTC], ["workout", "Legs"], ["mood", "Boring"], ["length", "45 Minutes"], ["created_at", 2017-03-20 20:29:51 UTC], ["updated_at", 2017-03-20 20:29:51 UTC]]
---
  def create
    @workout = Workout.new(workout_params)
    if @workout.save

UPDATE "workouts" SET "workout" = ?, "updated_at" = ? WHERE "workouts"."id" = ?  [["workout", "Biceps & Triceps"], ["updated_at", 2017-03-27 16:52:23 UTC], ["id", 2]]
---
  def update
    if @workout.update(workout_params)

DELETE FROM "workouts" WHERE "workouts"."id" = ?  [["id", 1]]
---
  def destroy
    @workout.destroy

SELECT  "workouts".* FROM "workouts" WHERE "workouts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def find_workout
    @workout = Workout.find(params[:id])